       77 WRK-VALOR        PIC S9(06)V99   VALUE ZEROES.
       77 WRK-VALOR-ED     PIC ZZZZ9,99    VALUE ZEROES.
       77 WRK-MESVENDA     PIC 9(02)       VALUE ZEROES.
       01 WRK-MESES.
           02 WRK-MES      PIC 9(06)V99    OCCURS 12 TIMES.

       01 WRK-MES-LISTAEXTENSO.
           02 FILLER PIC X(03) VALUE 'JAN'.
           02 FILLER PIC X(03) VALUE 'FEV'.
           02 FILLER PIC X(03) VALUE 'MAR'.
           02 FILLER PIC X(03) VALUE 'ABR'.
           02 FILLER PIC X(03) VALUE 'MAI'.
           02 FILLER PIC X(03) VALUE 'JUN'.
           02 FILLER PIC X(03) VALUE 'JUL'.
           02 FILLER PIC X(03) VALUE 'AGO'.
           02 FILLER PIC X(03) VALUE 'SET'.
           02 FILLER PIC X(03) VALUE 'OUT'.
           02 FILLER PIC X(03) VALUE 'NOV'.
           02 FILLER PIC X(03) VALUE 'DEZ'.
       01 WRK-MESES-EXTENSO REDEFINES WRK-MES-LISTAEXTENSO.
           02 WRK-MES-EXTENSO PIC X(03) OCCURS 12 TIMES.
