       77 WRK-VENDAS   PIC 9(06)V99    VALUE ZEROES.
       77 WRK-QT       PIC 9(03)       VALUE ZEROES.
       77 WRK-ACUM     PIC 9(08)V99    VALUE ZEROES.

       77 WRK-VALOR       PIC 9(06)V99    VALUE ZEROES.
       77 WRK-TAXAMES     PIC 9(02)       VALUE ZEROES.
       77 WRK-MESES       PIC 9(02)       VALUE ZEROES.
       77 WRK-VALOR-ED    PIC ZZZ.ZZ9,99  VALUE ZEROES.
