       IDENTIFICATION DIVISION.
       PROGRAM-ID. olamundo.
      ****************************
      * ÁREA DE COMENTÁRIOS
      * AUTOR = LUCAS
      * OBJETIVO = RECEBER NOME E SALÁRIO E IMPRIMIR FORMATADO COM USO DA VÍRGULA
      * DATA = 11/12/2024
      ****************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
	   DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       77 WRK-SALARIO PIC 9(06)V99 VALUE ZEROES.
       77 WRK-SALARIO-ED PIC $ZZZ.ZZ9,99 VALUE ZEROES.	

       PROCEDURE DIVISION.
	   ACCEPT WRK-NOME FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.
      ************* MOSTRA DADOS
           DISPLAY 'NOME: ' WRK-NOME.
           MOVE WRK-SALARIO TO WRK-SALARIO-ED.
	   DISPLAY 'SALARIO: ' WRK-SALARIO-ED.
           STOP RUN.


